# PowerPerLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..PowerPerLength Property
SpecTypeId Class See Also
---
Power per Length, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId PowerPerLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PowerPerLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PowerPerLength {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace